Согра_АЗС/src/Documents/Согра_Заправка/Согра_Заправка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Согра_Заправка</name>
  <registerRecords>AccumulationRegister.Согра_Заправки</registerRecords>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.Согра_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Согра_Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТоплива</name>
    <type>
      <types>EnumRef.Согра_ВидыТоплива</types>
    </type>
  </attributes>
</mdclass:Document>

Согра_АЗС/src/AccumulationRegisters/Согра_Заправки/Согра_Заправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Согра_Заправки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Согра_Водители</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТС</name>
    <type>
      <types>CatalogRef.Согра_ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидТоплива</name>
    <type>
      <types>EnumRef.Согра_ВидыТоплива</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Согра_АЗС/src/Documents/Согра_Заправка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Согра_Зарпавки 
	Движения.Согра_Зарпавки.Записывать = Истина;
	Движение = Движения.Согра_Заправки.Добавить();
	Движение.Период = Дата;
	Движение.ТС = ТС;
	Движение.ВидТоплива = ВидТоплива;
	Движение.Объем = Объем;
	Движение.Водитель = Водитель;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
